app/controllers/favorite_characters_controller.rb

    def index
        render json: FavoriteCharacter.all
---
SELECT "favorite_characters".* FROM "favorite_characters"

    def create
        FavoriteCharacter.create(favorite_params)
        user =  User.find(params[:user_id])
---
INSERT INTO "favorite_characters" ("user_id", "character_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 13], ["character_id", 579], ["created_at", "2020-01-21 15:40:05.854508"], ["updated_at", "2020-01-21 15:40:05.854508"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def destroy
<<<<<<< HEAD
        character = FavoriteCharacter.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 579], ["LIMIT", 1]]