app/controllers/favorite_spells_controller.rb

    def create
        FavoriteSpell.create(favorite_params)
        user =  User.find(params[:user_id])
---
INSERT INTO "favorite_spells" ("user_id", "spell_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 13], ["spell_id", 455], ["created_at", "2020-01-21 19:18:35.670269"], ["updated_at", "2020-01-21 19:18:35.670269"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def destroy
        spell = FavoriteSpell.find(params[:id])
---
SELECT "spells".* FROM "spells" WHERE "spells"."id" = $1 LIMIT $2  [["id", 455], ["LIMIT", 1]]