app/controllers/users_controller.rb

INSERT INTO "users" ("name", "house", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "pishi"], ["house", "Slytherin"], ["created_at", "2020-01-21 19:26:33.001271"], ["updated_at", "2020-01-21 19:26:33.001271"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    def create
      user = User.create(user_params)
      found_user = User.find_by id: user.id